# CreateBeginsWithRule Method

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ParameterFilterRuleFactory..::..CreateBeginsWithRule Method
ParameterFilterRuleFactory Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| CreateBeginsWithRule(ElementId, String) | Creates a filter rule that determines whether strings from the document begin with a certain string value. |
| CreateBeginsWithRule(ElementId, String, Boolean) | **Obsolete.** Creates a filter rule that determines whether strings from the document begin with a certain string value. |

# See Also
ParameterFilterRuleFactory Class
ParameterFilterRuleFactory Members
Autodesk.Revit.DB Namespace